Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnJoinNonhitFailure Property
 The highlighted column can't maintain attachment to the target. It will be treated as unattached until it can intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnJoinNonhitFailure { get; }
Public Shared ReadOnly Property ColumnJoinNonhitFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnJoinNonhitFailure {
	FailureDefinitionId^ get ();
}
static member ColumnJoinNonhitFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace